In [1]:
import os, copy, time
from pathlib import Path

import pandas as pd
import numpy as np
import datetime as dt

#https://scikit-learn.org/stable/modules/preprocessing.html
from sklearn import preprocessing
from sklearn.preprocessing import KBinsDiscretizer
from sklearn.impute import SimpleImputer

# We will use multiprocessing for simple additive processes. Further, we will expend for other cases.
# Sources: 
#https://medium.com/@vasista/parallel-processing-with-pandas-c76f88963005
#https://towardsdatascience.com/speeding-up-and-perfecting-your-work-using-parallel-computing-8bc2f0c073f8
import multiprocessing as mp
from multiprocessing import Pool
from functools import partial

import warnings
warnings.filterwarnings('ignore')

import matplotlib.pyplot as plt

# home-credit-default-risk tables
if not Path("./application_test.csv").is_file():
  ! wget https://www.dropbox.com/s/j9xwcj9ixki5t2l/home-credit-default-risk.zip?dl=0 -O data.zip
  ! unzip -q data.zip

# default-of-credit-card-clients-dataset
if not Path("./default_ucr.csv").is_file():
  ! wget https://www.dropbox.com/s/lj0d7qez18ea7dx/UCI_Credit_Card.csv?dl=0 -O default_ucr.csv

In [2]:
from fcleaning import (EmptyElim,
                       OutlDetect,                       
)
from fencoding import (Dtimetodata,
                       FEncoding,
                       FImputation    
)

In [3]:
# Read in the source datasets
dict = {
    'datasets':[
                # home-credit-default-risk tables
                pd.read_csv('./application_train.csv'),
                pd.read_csv('./application_test.csv'),
                pd.read_csv('./bureau.csv'),
                #pd.read_csv('./bureau_balance.csv'),
                #pd.read_csv('./POS_CASH_balance.csv'),
                #pd.read_csv('./credit_card_balance.csv'),
                # pd.read_csv('./previous_application.csv'),
                # pd.read_csv('./installments_payments.csv'),

                # default-of-credit-card-clients-datasets
                # pd.read_csv('./default_ucr.csv'),
    ],

    'name_dropped_columns':
                [
                 # home-credit-default-risk tables
                 ['SK_ID_CURR', 'TARGET'],
                 ['SK_ID_CURR'],
                 ['SK_ID_CURR',	'SK_ID_BUREAU'],
                 ['SK_ID_BUREAU'],
                 ['SK_ID_PREV',	'SK_ID_CURR'],
                 ['SK_ID_PREV',	'SK_ID_CURR'],
                 ['SK_ID_PREV',	'SK_ID_CURR'],
                 ['SK_ID_PREV',	'SK_ID_CURR'],

                 # default-of-credit-card-clients-datasets
                 ['ID', 'default.payment.next.month']              
    ],   
}

# Keep ID and target columns separately
dict['dropped_columns'] = [dict['datasets'][i][dict['name_dropped_columns'][i]] for i in range(len(dict['datasets']))]

# Drop ID and target columns from the tables
dict['datasets'] = [dict['datasets'][i].drop(dict['name_dropped_columns'][i], axis=1) for i in range(len(dict['datasets']))]

[np.unique([str(dict['datasets'][i][column].dtype) for column in dict['datasets'][i].columns]) for i in range(len(dict['datasets']))]

[array(['float64', 'int64', 'object'], dtype='<U7'),
 array(['float64', 'int64', 'object'], dtype='<U7'),
 array(['float64', 'int64', 'object'], dtype='<U7')]

In [4]:
X=pd.DataFrame([[1,2, np.nan], [3,4, np.nan], [np.nan, np.nan, 2], [10000, 2, np.nan], [0.1, 3,2], [1,1,2]])
X

         0    1    2
0      1.0  2.0  NaN
1      3.0  4.0  NaN
2      NaN  NaN  2.0
3  10000.0  2.0  NaN
4      0.1  3.0  2.0
5      1.0  1.0  2.0

In [5]:
emptyelim = EmptyElim(n_jobs = -1,
                      chunks = None,
                      )
emptyelim.fit(X)

 col_names: {}

In [6]:
emptyelim.transform(X)

         0    1    2
0      1.0  2.0  NaN
1      3.0  4.0  NaN
2      NaN  NaN  2.0
3  10000.0  2.0  NaN
4      0.1  3.0  2.0
5      1.0  1.0  2.0

In [7]:
emptyelim.fit_transform(X)

 col_names: {}

         0    1    2
0      1.0  2.0  NaN
1      3.0  4.0  NaN
2      NaN  NaN  2.0
3  10000.0  2.0  NaN
4      0.1  3.0  2.0
5      1.0  1.0  2.0

In [8]:
outldetect = OutlDetect(outliers_detection_technique='iqr_proximity_rule', 
                        n_jobs=-1)

In [9]:
outldetect.fit(X)

 col_outl_info: {0: (-2.0, 6.0), 1: (0.5, 4.5), 2: (2.0, 2.0)}

In [10]:
outldetect.transform(X)

     0    1    2
0  1.0  2.0  NaN
1  3.0  4.0  NaN
2  NaN  NaN  2.0
3  6.0  2.0  NaN
4  0.1  3.0  2.0
5  1.0  1.0  2.0

In [11]:
outldetect.fit_transform(X)

 col_outl_info: {0: (-2.0, 6.0), 1: (0.5, 4.5), 2: (2.0, 2.0)}

     0    1    2
0  1.0  2.0  NaN
1  3.0  4.0  NaN
2  NaN  NaN  2.0
3  6.0  2.0  NaN
4  0.1  3.0  2.0
5  1.0  1.0  2.0

In [12]:
X = dict['datasets'][2][['DAYS_CREDIT', 'DAYS_CREDIT_ENDDATE', 'DAYS_ENDDATE_FACT', 'DAYS_CREDIT_UPDATE']]
X

         DAYS_CREDIT  ...  DAYS_CREDIT_UPDATE
0               -497  ...                -131
1               -208  ...                 -20
2               -203  ...                 -16
3               -203  ...                 -16
4               -629  ...                 -21
...              ...  ...                 ...
1716423          -44  ...                 -19
1716424        -2648  ...               -2493
1716425        -1809  ...                -967
1716426        -1878  ...               -1508
1716427         -463  ...                -387

[1716428 rows x 4 columns]

In [13]:
dtimetodata = Dtimetodata(n_jobs=-1, dtime_col_names = {
                                                        'ddays' : ['DAYS_CREDIT', 'DAYS_CREDIT_ENDDATE', 'DAYS_ENDDATE_FACT', 'DAYS_CREDIT_UPDATE'],
                                                        'dmonths' : [],
                                                        'dyears' : []
                                                      },               
                              time_encode = True, 
                              drop_current = True
                              )

In [14]:
dtimetodata.transform(X)

         DAYS_CREDIT_date_year  ...  DAYS_CREDIT_UPDATE_date_day
0                         2018  ...                           23
1                         2019  ...                           12
2                         2019  ...                           16
3                         2019  ...                           16
4                         2018  ...                           11
...                        ...  ...                          ...
1716423                   2019  ...                           13
1716424                   2012  ...                            5
1716425                   2015  ...                            9
1716426                   2014  ...                           15
1716427                   2018  ...                           10

[1716428 rows x 12 columns]

In [15]:
X = dict['datasets'][2]
X

        CREDIT_ACTIVE CREDIT_CURRENCY  ...  DAYS_CREDIT_UPDATE  AMT_ANNUITY
0              Closed      currency 1  ...                -131          NaN
1              Active      currency 1  ...                 -20          NaN
2              Active      currency 1  ...                 -16          NaN
3              Active      currency 1  ...                 -16          NaN
4              Active      currency 1  ...                 -21          NaN
...               ...             ...  ...                 ...          ...
1716423        Active      currency 1  ...                 -19          NaN
1716424        Closed      currency 1  ...               -2493          NaN
1716425        Closed      currency 1  ...                -967          NaN
1716426        Closed      currency 1  ...               -1508          NaN
1716427        Closed      currency 1  ...                -387          NaN

[1716428 rows x 15 columns]

In [16]:
fencoding = FEncoding(n_jobs=-1)
fencoding.initialize_types(X)

 DAYS_CREDIT has type int64 and number of unique values: 2923, will be considered as a numerical


 CREDIT_DAY_OVERDUE has type int64 and number of unique values: 942, will be considered as a numerical


 DAYS_CREDIT_UPDATE has type int64 and number of unique values: 2982, will be considered as a numerical

{'categor_columns': ['CREDIT_ACTIVE',
  'CREDIT_CURRENCY',
  'CNT_CREDIT_PROLONG',
  'CREDIT_TYPE'],
 'numer_columns': ['DAYS_CREDIT',
  'CREDIT_DAY_OVERDUE',
  'DAYS_CREDIT_ENDDATE',
  'DAYS_ENDDATE_FACT',
  'AMT_CREDIT_MAX_OVERDUE',
  'AMT_CREDIT_SUM',
  'AMT_CREDIT_SUM_DEBT',
  'AMT_CREDIT_SUM_LIMIT',
  'AMT_CREDIT_SUM_OVERDUE',
  'DAYS_CREDIT_UPDATE',
  'AMT_ANNUITY'],
 'time_columns': []}

In [17]:
fencoding.encode_categor(X, method = 'OneHotEncoder')

 DAYS_CREDIT has type int64 and number of unique values: 2923, will be considered as a numerical


 CREDIT_DAY_OVERDUE has type int64 and number of unique values: 942, will be considered as a numerical


 DAYS_CREDIT_UPDATE has type int64 and number of unique values: 2982, will be considered as a numerical

         DAYS_CREDIT  ...  CREDIT_TYPE_Unknown type of loan
0               -497  ...                                 0
1               -208  ...                                 0
2               -203  ...                                 0
3               -203  ...                                 0
4               -629  ...                                 0
...              ...  ...                               ...
1716423          -44  ...                                 0
1716424        -2648  ...                                 0
1716425        -1809  ...                                 0
1716426        -1878  ...                                 0
1716427         -463  ...                                 0

[1716428 rows x 44 columns]

In [18]:
X = fencoding.encode_categor(X, method = 'OrdinalEncoder')
X

 DAYS_CREDIT has type int64 and number of unique values: 2923, will be considered as a numerical


 CREDIT_DAY_OVERDUE has type int64 and number of unique values: 942, will be considered as a numerical


 DAYS_CREDIT_UPDATE has type int64 and number of unique values: 2982, will be considered as a numerical

         DAYS_CREDIT  CREDIT_DAY_OVERDUE  ...  CNT_CREDIT_PROLONG  CREDIT_TYPE
0               -497                   0  ...                   0            3
1               -208                   0  ...                   0            4
2               -203                   0  ...                   0            3
3               -203                   0  ...                   0            4
4               -629                   0  ...                   0            3
...              ...                 ...  ...                 ...          ...
1716423          -44                   0  ...                   0           10
1716424        -2648                   0  ...                   0            3
1716425        -1809                   0  ...                   0            3
1716426        -1878                   0  ...                   0            3
1716427         -463                   0  ...                   0           10

[1716428 rows x 15 columns]

In [19]:
X = fencoding.bucket_numerical(X, n_bins=5, columns_to_buck = 'all_numerical', 
                           drop_current = True)

 DAYS_CREDIT has type int64 and number of unique values: 2923, will be considered as a numerical


 CREDIT_DAY_OVERDUE has type int64 and number of unique values: 942, will be considered as a numerical


 DAYS_CREDIT_UPDATE has type int64 and number of unique values: 2982, will be considered as a numerical


 DAYS_CREDIT bucketing ...

 AMT_CREDIT_SUM_LIMIT bucketing ...

 CREDIT_DAY_OVERDUE bucketing ...

 AMT_CREDIT_SUM_OVERDUE bucketing ...

 DAYS_CREDIT_ENDDATE bucketing ...

 DAYS_ENDDATE_FACT bucketing ...

 DAYS_CREDIT_UPDATE bucketing ...

 AMT_ANNUITY bucketing ...

 AMT_CREDIT_MAX_OVERDUE bucketing ...

 AMT_CREDIT_SUM bucketing ...

 AMT_CREDIT_SUM_DEBT bucketing ...

In [20]:
X

         DAYS_CREDIT_bucketed  ...  CREDIT_TYPE
0                           3  ...            3
1                           4  ...            4
2                           4  ...            3
3                           4  ...            4
4                           3  ...            3
...                       ...  ...          ...
1716423                     4  ...           10
1716424                     1  ...            3
1716425                     1  ...            3
1716426                     1  ...            3
1716427                     4  ...           10

[1716428 rows x 15 columns]

In [21]:
fimputation = FImputation('tree-based', 
                          fill_with_value = 'extreme_values', 
                          n_jobs = -1,
                          )
fimputation.impute(X)

         DAYS_CREDIT_bucketed  ...  CREDIT_TYPE
0                           3  ...            3
1                           4  ...            4
2                           4  ...            3
3                           4  ...            4
4                           3  ...            3
...                       ...  ...          ...
1716423                     4  ...           10
1716424                     1  ...            3
1716425                     1  ...            3
1716426                     1  ...            3
1716427                     4  ...           10

[1716428 rows x 15 columns]

In [22]:
X = pd.DataFrame([
'Jan 19, 1990',
'January 19, 1990',
'Jan 19,1990',
'01/19/1990',
'01/19/90',
'1990',
'Jan 1990',
'01.02.2000',
'2000.02.01',
'01-02-2000',
'2111-01-01 12:48:20',
'123',
'abs 123', 
1339521878.04,
'1339521878.04'
]).T
X = X.append(X)
X

             0                 1   ...           13             14
0  Jan 19, 1990  January 19, 1990  ...  1.33952e+09  1339521878.04
0  Jan 19, 1990  January 19, 1990  ...  1.33952e+09  1339521878.04

[2 rows x 15 columns]

In [23]:
fencoding = FEncoding(-1)

In [24]:
fencoding.initialize_types(X)

{'categor_columns': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
 'numer_columns': [],
 'time_columns': []}

In [25]:
X = fencoding.date_replace(X)
X

 time_columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 13, 14]

          0          1          2   ...       12         13         14
0 1990-01-19 1990-01-19 1990-01-19  ...  abs 123 2012-06-12 2012-06-12
0 1990-01-19 1990-01-19 1990-01-19  ...  abs 123 2012-06-12 2012-06-12

[2 rows x 15 columns]

In [26]:
fencoding.initialize_types(X)

{'categor_columns': [11, 12],
 'numer_columns': [],
 'time_columns': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 13, 14]}